<template>
  <div class="ua-container">
      <h3>修改密码服务协议</h3>

      <h4>重要须知： </h4>

      <h4>【首部及导言】 </h4>
      <p>使用修改密码服务（以下简称“本服务”）时，您应当了解使用本服务的分险。请您务必审慎阅读、充分理解各条款内容，特别是免除或者限制责任的条款，以及开通或使用某项服务的单独协议，并选择接受或不接受。限制、免责条款可能以加粗形式提示您注意。</p>
      <p>除非您已阅读并接受本协议所有条款，否则您无权使用本服务。您的任何使用本服务的行为即视为您已阅读并同意受上述协议的约束。</p>
      <p>如果您未满18周岁，请在法定监护人的陪同下阅读本协议及其他上述协议，并特别注意未成年人使用条款。</p>
       
      <h4>一、【协议的范围】 </h4>
      <p>1.1 本协议是您与罗湖城市管理局之间关于您使用本服务所订立的协议。</p>
       
      <h4>二、【释义】 </h4>
      <p>2.1 本服务，是指用户因密码遗忘、遗失或其他原因导致帐号无法正常登陆时，用户使用罗湖城市管理局提供的忘记密码服务，并按照要求填写、提供相关资料以找回帐号密码的行为。</p>
       
      <h4>三、【忘记密码服务流程】</h4>
      <p>3.1 用户因帐号密码遗忘、遗失或其他原因导致帐号无法正常登陆，用户应及时登陆平台使用忘记密码服务找回账号密码。</p>
      <p>3.2 您进入忘记密码页面后须按要求输入用户姓名、手机号码、短信验证码、设置新的密码等相关信息。</p>
      <p>3.3 您在使用本服务过程中输入的信息、提交的资料等必须真实、合法、有效。</p>
      <p>3.4 修改密码成功之后，您应牢记密码。</p>
       
      <h4>四、【用户使用须知】</h4>
      <p>4.1 您应保证提供给罗湖城市管理局的资料均为真实、合法、有效，该资料对于使用本服务及找回丢失的帐号至关重要。如因用户提供虚假资料或被他人获悉自己的注册资料，从而导致的损失由用户本人承担，损失包括但不限于无法取回丢失的帐号及其他增值服务产品，承载于帐户内的信息资料等。</p>
      <p>4.2 为保护您帐号的安全，您需要采取必要的、有效的措施保护您的帐号安全，避免被他人获悉您的帐号信息。您保证，只对本人注册并享有使用权的帐号进行修改密码，不得对其他用户的帐号或受让的帐号进行修改密码。</p>
      <p>4.3 如帐号涉及行政、司法调查，案件侦破，诉讼等任何存在较大争议的情形，罗湖城市管理局可能对涉及的帐号暂时冻结。帐号冻结期间，用户不得对冻结帐号进行更改密码。</p>
      <p>4.4 因用户违反法律法规、本协议或罗湖城市管理局相关的服务条款的规定，导致罗湖城市管理局冻结、回收帐号的，用户不得对冻结、回收的帐号进行更改密码操作。</p>
       
      <h4>五、【法律责任与免责】</h4>
      <p>5.1 为了增进用户体验、完善服务内容，罗湖城市管理局有权随时自行修改本服务功能及规则而不需通知用户，如有必要，修改会以通告形式公布于罗湖城市管理局网站页面上。</p>
      <p>5.2 如您违反法律法规、本协议或腾讯相关的服务条款的规定，罗湖城市管理局有权进行独立判断并随时限制或终止为您提供服务。由此，导致或产生的任何损失或第三方主张的任何索赔、要求等，由您自行承担。</p>
       
      <h4>六、【其他】 </h4>
      <p>6.1 您使用本服务即视为您已阅读并同意受本协议的约束。罗湖城市管理局有权在必要时修改本协议条款。本协议条款变更后，如果您继续使用本服务，即视为您已接受修改后的协议。如果您不接受修改后的协议，应当停止使用本服务。</p>
      <p>6.3 本协议签订地为中华人民共和国广东省深圳市罗湖区。</p>
      <p>6.4 本协议的成立、生效、履行、解释及纠纷解决，适用中华人民共和国大陆地区法律（不包括冲突法）。</p>
      <p>6.5 若您和罗湖城市管理局之间发生任何纠纷或争议，首先应友好协商解决；协商不成的，您同意将纠纷或争议提交本协议签订地有管辖权的人民法院管辖。</p>
      <p>6.6 本协议所有条款的标题仅为阅读方便，本身并无实际涵义，不能作为本协议涵义解释的依据。</p>
      <p>6.7 本协议条款无论因何种原因部分无效或不可执行，其余条款仍有效，对双方具有约束力。</p>
      <p>6.8 如果您对本服务有任何意见或建议，可与罗湖城市管理局客户服务部门联系，罗湖城市管理局客户服务热线：0755-25666709，我们会给予您必要的帮助。</p>
       
      <h4>本《协议》版权由罗湖城市管理局所有，罗湖城市管理局保留一切对本《协议》解释的权利。</h4>

  </div>
</template>
<<script>
export default {
  name: 'user-agreement',
  data () {
    return {
    }
  }
}
</script>
<style scoped>
.ua-container {
  padding: 10px 2px;
}
h3 {
  text-align: center;
}
h4 {
  margin: 5px 0;
  line-height: 1.2;
}
p {
  margin: 3px 5px;
}
</style>