<template>
  <div class="ua-container">
    <h3>用户注册协议</h3>
    <h4>一、总则</h4>
    <p>1.1 平台的所有权和运营权罗湖城市管理局所有。 </p>
    <p>1.2 用户在注册之前，应当仔细阅读本协议，并同意遵守本协议后方可成为注册用户。一旦注册成功，则用户与平台之间自动形成协议关系，用户应当受本协议的约束。用户在使用特殊的服务或产品时，应当同意接受相关协议后方能使用。 </p>
    <p>1.3 本协议则可由平台随时更新，用户应当及时关注并同意罗湖城市管理局不承担通知义务。罗湖城市管理局的通知、公告、声明或其它类似内容是本协议的一部分。</p>
    <h4>二、服务内容</h4>
    <p>2.1 平台的具体内容由罗湖城市管理局根据实际情况提供。 </p>
    <p>2.2 罗湖城市管理局仅提供相关的网络服务，除此之外与相关网络服务有关的设备(如个人电脑、手机、及其他与接入互联网或移动网有关的装置)及所需的费用(如为接入互联网而支付的电话费及上网费、为使用移动网而支付的手机费)均应由用户自行负担。</p>
    <h4>三、用户帐号</h4>
    <p>3.1 经软件注册系统完成注册程序并通过手机认证的用户即成为正式用户，可以获得软件规定用户所应享有的一切权限;未经认证仅享有软件规定的部分会员权限。平台有权对会员的权限设计进行变更。 </p>
    <p>3.2用户有义务保证密码和帐号的安全，用户利用该密码和帐号所进行的一切活动引起的任何损失或损害，由用 户自行承担全部责任，本软件不承担任何责任。如用户发现帐号遭到未授权的使用或发生其他任何安全问题，应立即修改帐号密码并妥善保管，如有必要，请通知管理员。因黑客行为或用户的保管疏忽导致帐号非法使用，罗湖城事管理局不承担任何责任。</p>
    <h4>四、使用规则</h4>
    <p>4.1本软件为用户提供微信端、电脑WEB端等各种形式服务，软件提供服务内容包括工作台工单处理、工单列表、角色管理等技术功能，用户注册成为平台用户或管理端提供账号成为平台角色的，可以在平台上进行发起需求，处理工单，这些功能服务可能根据用户需求的变化，随着因服务版本不同、或服务方的单方判断而被优化或修改，或因定期、不定期的维护而暂缓提供。</p>
    <h4>五、隐私保护</h4>
    <p>5.1 罗湖城市管理局不对外公开或向第三方提供单个用户的注册资料及用户在使用网络服务时存储在罗湖城市管理局服务器的非公开内容，但下列情况除外：事先获得用户的明确授权; (2)根据有关的法律法规要求;(3)按照相关政府主管部门的要求;(4)为维护社会公众的利益。</p>
    <p>5.2 罗湖城市管理局能会与第三方合作向用户提供相关的网络服务，在此情况下，如该第三方同意承担与罗湖城市管理局同等的保护用户隐私的责任，则罗湖城市管理局有权将用户的注册资料等提供给该第三方。</p>
    <p>5.3 在不透露单个用户隐私资料的前提下，罗湖城市管理局有权对整个用户数据库进行分析并对用户数据库进行商业上的利用。</p>
    <h4>六、版权声明</h4>
    <p>6.1 本软件的文字、图片、音频、视频等版权均归罗湖城市管理局享有或与作者共同享有，未经本站许可，不得任意转载。 </p>
    <p>6.2 本软件特有的标识、版面设计、编排方式等版权均属于罗湖城市管理局享有，未经本站许可，不得任意复制或转载。 </p>
    <p>6.3 使用本软件的任何内容均应注明“来源于平台”及署上作者姓名，按法律规定需要支付稿酬的，应当通知罗湖城市管理局及支付稿酬，并独立承担一切法律责任。</p>
    <p>6.4 恶意转载罗湖城市管理局内容的，罗湖城市管理局保留将其诉诸法律的权利。</p>
    <h4>七、责任声明</h4>
    <p>7.1 用户明确同意其使用罗湖城市管理局网络服务所存在的风险及一切后果将完全由用户本人承担，平台对此不承担任何责任。 </p>
    <p>7.2 本软件无法保证网络服务一定能满足用户的要求，也不保证网络服务的及时性、安全性、准确性。 </p>
    <p>7.3 本软件不保证为方便用户而设置的外部链接的准确性和完整性，同时，对于该等外部链接指向的不由本软件实际控制的任何网页上的内容，罗湖城市管理局不承担任何责任。</p>
    <p>7.4 对于因不可抗力或罗湖城市管理局不能控制的原因造成的网络服务中断或其它缺陷，罗湖城市管理局不承担任何责任，但将尽力减少因此而给用户造成的损失和影响。</p>
    <p>7.5 对于向用户提供服务的质量缺陷本身及其引发的任何损失，罗湖城市管理局无需承担任何责任：罗湖城市管理局向用户免费提供的各项网络服务; </p>
    <p>7.6 罗湖城市管理局有权于任何时间暂时或永久修改或终止本服务(或其任何部分)，而无论其通知与否，罗湖城市管理局对用户和任何第三人均无需承担任何责任。</p>
    <h4>八、附则</h4>
    <p>8.1 本协议的订立、执行和解释及争议的解决均应适用中华人民共和国法律。 </p>
    <p>8.2 如本协议中的任何条款无论因何种原因完全或部分无效或不具有执行力，本协议的其余条款仍应有效并且有约束力。</p>
    <p>8.3 本协议解释权及修订权罗湖城市管理局所有。</p>
  </div>
</template>
<<script>
export default {
  name: 'user-agreement',
  data () {
    return {
    }
  }
}
</script>
<style scoped>
.ua-container {
  padding: 10px 2px;
}
h3 {
  text-align: center;
}
h4 {
  margin: 5px 0;
}
p {
  margin: 3px 5px;
}
</style>


